bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
/**
 * @file hwzc.c
 *
 * @brief Hardware ZC detection via ADC digital comparators + SCCP timers.
 *
 * State machine per commutation step:
 *   BLANKING -> WATCHING -> COMM_PENDING -> commutate -> BLANKING
 *
 * All functions called from priority-7 ISRs (comparator or SCCP1) except
 * HWZC_Init (called from ServiceInit) and HWZC_Enable (called from ADC ISR
 * at the moment of crossover handoff).
 *
 * Binding rules enforced:
 *   Rule 2: Comparator IE disabled before PINSEL changes
 *   Rule 3: hwzc.phase written BEFORE starting SCCP1 timer
 *   Rule 4: Threshold from garudaData.bemf.zcThreshold
 *   Rule 10: Comparator ISR trusts ADnCMPSTAT, no re-read
 *   Rule 13: stepPeriodHR protected by seqlock (writeSeq)
 *
 * Component: HWZC
 */

#include "../garuda_config.h"

#if FEATURE_ADC_CMP_ZC

#include "hwzc.h"
#include "commutation.h"
#include "../garuda_calc_params.h"
#include "../hal/hal_adc.h"
#include "../hal/hal_timer.h"
#include <xc.h>

/**
 * @brief Initialize HWZC state to idle defaults.
 * Called from GARUDA_ServiceInit().
 */
void HWZC_Init(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.phase = HWZC_IDLE;
    pData->hwzc.enabled = false;
    pData->hwzc.enablePending = false;
    pData->hwzc.activeCore = 0;
    pData->hwzc.lastZcStamp = 0;
    pData->hwzc.lastCommStamp = 0;
    pData->hwzc.stepPeriodHR = 0;
    pData->hwzc.writeSeq = 0;
    pData->hwzc.commSeq = 0;
    pData->hwzc.goodZcCount = 0;
    pData->hwzc.missCount = 0;
    pData->hwzc.fallbackPending = false;
    pData->hwzc.firstZcAfterEnable = false;
    pData->hwzc.dbgLatchDisable = false;
    pData->hwzc.stepsSinceLastHwZc = 0;
    pData->hwzc.totalZcCount = 0;
    pData->hwzc.totalMissCount = 0;
    pData->hwzc.totalCommCount = 0;
    pData->hwzc.rejectsThisStep = 0;
    pData->hwzc.dbgTimeoutAdcVal = 0;
    pData->hwzc.dbgTimeoutThresh = 0;
    pData->hwzc.dbgTimeoutCmpmod = 0;
    pData->hwzc.dbgTimeoutCmpstat = 0;
    pData->hwzc.dbgTimeoutCore = 0;
    pData->hwzc.dbgTimeoutStep = 0;
    pData->hwzc.dbgTimeoutBemfThresh = 0;
    pData->hwzc.dbgEnableStepPeriod = 0;
    pData->hwzc.dbgAdvanceDeg = 0;
#if FEATURE_BEMF_INTEGRATION
    pData->hwzc.shadowHwzcSkipCount = 0;
    pData->hwzc.obsCommSeq = 0;
    pData->hwzc.obsLastCommTick = 0;
#endif

    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);
}

/**
 * @brief Activate hardware ZC detection. Called from ADC ISR at the
 * post-CheckDeadline commutation hook when enablePending && wasZcDeadline.
 * The new step has just been applied by COMMUTATION_AdvanceStep().
 */
void HWZC_Enable(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.enabled = true;
    pData->hwzc.enablePending = false;
    pData->hwzc.goodZcCount = 0;
    pData->hwzc.missCount = 0;
    pData->hwzc.noiseRejectCount = 0;
    pData->hwzc.stepsSinceLastHwZc = 1;  /* First step: IIR valid with seeded lastZcStamp */
    pData->hwzc.firstZcAfterEnable = true; /* Bypass plausibility gate + IIR on 1st ZC */

    /* Seed stepPeriodHR from software ZC step period */
    pData->hwzc.dbgEnableStepPeriod = pData->timing.stepPeriod;
    pData->hwzc.stepPeriodHR = HWZC_ADC_TO_SCCP2(pData->timing.stepPeriod);

    /* Initialize timestamps. Seed lastZcStamp to half a step period before
     * now so the first measured interval (first real ZC - lastZcStamp) is
     * approximately one full step, not half a step. Without this, the first
     * IIR update biases stepPeriodHR low, causing an early commutation. */
    uint32_t now = HAL_SCCP2_ReadTimestamp();
    pData->hwzc.lastZcStamp = now - pData->hwzc.stepPeriodHR / 2;
    pData->hwzc.lastCommStamp = now;

    /* Enable SCCP1 interrupt (priority already set by ServiceInit).
     * Clear any stale flag first to prevent immediate spurious ISR entry. */
    _CCT1IF = 0;
    _CCT1IE = 1;

    /* Arm hardware for the current (new) step */
    HWZC_OnCommutation(pData);
}

/**
 * @brief Deactivate hardware ZC and request fallback to software ZC.
 * Called from SCCP1 ISR (on miss-limit) or when eRPM drops below crossover.
 * Sets fallbackPending for the ADC ISR to perform the actual re-seed.
 */
void HWZC_Disable(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.enabled = false;

    /* Stop timer and disable all HW ZC interrupts.
     * Clear _CCT1IF to prevent stale event on next HWZC_Enable(). */
    HAL_SCCP1_Stop();
    _CCT1IE = 0;
    _CCT1IF = 0;
    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);

    pData->hwzc.phase = HWZC_IDLE;
    pData->hwzc.fallbackPending = true;
}

/**
 * @brief Set up ZC detection for the current commutation step.
 * Configures comparator channel, PINSEL, threshold, and starts blanking timer.
 * Called from SCCP1 ISR after commutation fires, and from HWZC_Enable().
 */
void HWZC_OnCommutation(volatile GARUDA_DATA_T *pData)
{
    uint32_t now = HAL_SCCP2_ReadTimestamp();
    pData->hwzc.lastCommStamp = now;
    pData->hwzc.rejectsThisStep = 0;

    /* Determine floating phase and comparator for this step */
    uint8_t step = pData->currentStep;
    uint8_t floatPhase = commutationTable[step].floatingPhase;
    int8_t pol = commutationTable[step].zcPolarity;
    bool risingZc = (pol > 0);

    /* Disable both comparator IEs before any mux change (Rule 2) */
    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);

    /* Select active ADC core and PINSEL */
    uint8_t core;
    if (floatPhase == FLOATING_PHASE_B)
    {
        core = 1;  /* AD1CH5, PINSEL fixed at 11 */
    }
    else
    {
        core = 2;  /* AD2CH1 */
        uint8_t pinsel = (floatPhase == FLOATING_PHASE_A) ? 10 : 7;
        HAL_ADC_SetHighSpeedPinsel(pinsel);
    }
    pData->hwzc.activeCore = core;

    /* Compute threshold with deadband (Rule 4) */
    uint16_t thresh = pData->bemf.zcThreshold;
    if (risingZc)
        thresh = (thresh + HWZC_CMP_DEADBAND < 4095) ? thresh + HWZC_CMP_DEADBAND : 4095;
    else
        thresh = (thresh > HWZC_CMP_DEADBAND) ? thresh - HWZC_CMP_DEADBAND : 0;

    HAL_ADC_ConfigComparator(core, thresh, risingZc);

    /* Calculate blanking delay from step period */
    uint32_t blankTicks = pData->hwzc.stepPeriodHR * HWZC_BLANKING_PERCENT / 100;
    if (blankTicks < 100) blankTicks = 100;  /* Minimum 1us blanking */

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_BLANKING;

    HAL_SCCP1_StartOneShot(blankTicks);
}

/**
 * @brief Blanking period expired — enable comparator and start timeout timer.
 * Called from SCCP1 ISR when phase == HWZC_BLANKING.
 */
void HWZC_OnBlankingExpired(volatile GARUDA_DATA_T *pData)
{
#if !HWZC_USE_SW_COMPARE
    uint8_t core = pData->hwzc.activeCore;

    /* Clear any stale comparator events, then enable interrupt */
    HAL_ADC_ClearComparatorFlag(core);
    HAL_ADC_EnableComparatorIE(core);
#else
    /* SW compare mode: leave the HW digital comparator IE disabled.
     * ZC detection runs in the 24 kHz ADC ISR via HWZC_OnSoftwareSample(). */
#endif

    /* Timeout = 2x step period (same as software ZC) */
    uint32_t timeoutTicks = pData->hwzc.stepPeriodHR * 2;

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_WATCHING;

    HAL_SCCP1_StartOneShot(timeoutTicks);
}

/**
 * @brief ZC detected by ADC comparator.
 * Comparator IE already disabled and CMPSTAT cleared by ISR stub.
 * Records timestamp, updates step period via seqlock, schedules commutation.
 */
void HWZC_OnZcDetected(volatile GARUDA_DATA_T *pData)
{
    /* Off-time gate (PWMxH-LOW rejection) was REMOVED (2026-04-20).
     *
     * The gate added up to ~42 µs of detection latency (one full PWM cycle
     * at 24 kHz) when a real ZC happened to cross the threshold during
     * PWM OFF-time. At 118 k eRPM (sector = 85 µs) that's ~50 % of a
     * sector — the 22° TIMING_ADVANCE_MAX_DEG couldn't compensate it, and
     * the motor topped out around 88 k instead of the 118 k milestone
     * recorded at commit 868b2ff.
     *
     * The plausibility gate below (reject interval < 70 % of stepPeriodHR)
     * is sufficient alone for phantom rejection — it was what the 118 k
     * run used, and phantoms whose spacing happens to land above 70 % of
     * the expected sector are rare enough that the IIR absorbs them.
     */
    uint32_t zcStamp = HAL_SCCP2_ReadTimestamp();

    /* First ZC after HWZC_Enable: bypass plausibility gate AND skip IIR.
     * The seeded lastZcStamp is a half-step guess based on where morph exit
     * happened to fall in the rotor cycle. The first measured interval is
     * therefore rotor-position-dependent and not representative — it can be
     * anywhere from 10% to 190% of a real step period. Accepting it blindly
     * risks (a) false reject by plausibility gate → timeout cascade → HWZC
     * disable → stall, or (b) IIR getting dragged off stepPeriodHR. Just
     * anchor lastZcStamp; the SECOND ZC gives a clean, full-step interval. */
    if (pData->hwzc.firstZcAfterEnable)
    {
        pData->hwzc.firstZcAfterEnable = false;
        HAL_SCCP1_Stop();
        pData->hwzc.lastZcStamp = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;

        /* Schedule commDelay using seeded stepPeriodHR (same logic below) */
        uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
        {
            uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
            uint16_t advDeg;
            if (eRPM <= RT_RAMP_TARGET_ERPM)
                advDeg = TIMING_ADVANCE_MIN_DEG;
            else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
                advDeg = RT_TIMING_ADV_MAX_DEG;
            else
            {
                uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
                uint32_t pos = eRPM - RT_RAMP_TARGET_ERPM;
                advDeg = TIMING_ADVANCE_MIN_DEG +
                    (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                               * pos / range);
            }
            commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
            pData->hwzc.dbgAdvanceDeg = advDeg;
        }
#else
        commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
        if (commDelay < 10) commDelay = 10;
        pData->hwzc.phase = HWZC_COMM_PENDING;
        HAL_SCCP1_StartOneShot(commDelay);
        return;
    }

    /* Noise rejection: motor inertia prevents >50% speed change per step.
     * Any shorter interval is PWM switching noise, not a real BEMF crossing.
     * Check BEFORE cancelling timeout — noise must not eat the timeout.
     *
     * Hard floor: RT_HWZC_MIN_STEP_TICKS corresponds to RT_MAX_CLOSED_LOOP_ERPM.
     * Any interval below that is physically impossible (motor can't spin faster
     * than max). Using this as the floor prevents IIR collapse runaway: without
     * it, as stepPeriodHR drops, the 70% gate drops with it, accepting shorter
     * and shorter phantoms and pulling IIR to the MIN_STEP floor. */
    uint32_t interval = zcStamp - pData->hwzc.lastZcStamp;
    uint32_t minInterval = pData->hwzc.stepPeriodHR
                           * HWZC_MIN_INTERVAL_PCT / 100;
    if (minInterval < RT_HWZC_MIN_STEP_TICKS)
        minInterval = RT_HWZC_MIN_STEP_TICKS;

    if (interval < minInterval)
    {
        /* Noise — re-arm comparator, keep timeout running */
        pData->hwzc.noiseRejectCount++;
        pData->hwzc.rejectsThisStep++;
        uint8_t core = pData->hwzc.activeCore;
        HAL_ADC_ClearComparatorFlag(core);
        HAL_ADC_EnableComparatorIE(core);
        return;
    }

    /* Cancel the timeout timer */
    HAL_SCCP1_Stop();

    /* Update stepPeriodHR with seqlock (Rule 13).
     * Guard 1: only update IIR when this ZC follows exactly one commutation
     * (consecutive detection). Multi-step intervals include timeout periods,
     * not real motor periods — they contaminate the estimator.
     * Guard 2: freeze IIR for the first N ZCs after HWZC_Enable. A single
     * phantom or mistimed ZC during morph handoff used to pull stepPeriodHR
     * rapidly toward floor (observed in ~50% of morph attempts). Holding the
     * seeded stepPeriodHR for a few cycles lets the motor lock in at the
     * morph-exit rate before the IIR starts adapting. */
    if (pData->hwzc.stepsSinceLastHwZc == 1
        && pData->hwzc.goodZcCount >= HWZC_IIR_FREEZE_ZC_COUNT)
    {
        pData->hwzc.writeSeq++;  /* odd = write in progress */
        uint32_t newPeriod = (3 * pData->hwzc.stepPeriodHR + interval) / 4;
        if (newPeriod < RT_HWZC_MIN_STEP_TICKS)
            newPeriod = RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.stepPeriodHR = newPeriod;
        pData->hwzc.writeSeq++;  /* even = stable */
    }
    pData->hwzc.stepsSinceLastHwZc = 0;

    pData->hwzc.lastZcStamp = zcStamp;

    /* Track consecutive good ZCs (saturate to prevent stale re-seed) */
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* Calculate commutation delay: half step period (30 degrees).
     * With timing advance, the delay is reduced proportionally.
     *
     * Uses stepPeriodHR (IIR-filtered, gain 0.25). Tried using the fresh
     * `interval` directly (2026-04-20) — made trip eRPM worse (55k→45k)
     * because interval-to-interval noise (phantom-reject-induced jitter)
     * fed directly into commDelay. The IIR is doing real filtering work.
     */
    uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
    {
        uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
        uint16_t advDeg;
        if (eRPM <= RT_RAMP_TARGET_ERPM)
            advDeg = TIMING_ADVANCE_MIN_DEG;
        else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
            advDeg = RT_TIMING_ADV_MAX_DEG;
        else
        {
            uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
            uint32_t pos = eRPM - RT_RAMP_TARGET_ERPM;
            advDeg = TIMING_ADVANCE_MIN_DEG +
                (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                           * pos / range);
        }
        commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
        pData->hwzc.dbgAdvanceDeg = advDeg;
    }
#else
    commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
    if (commDelay < 10) commDelay = 10;  /* Minimum 100ns */

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_COMM_PENDING;

    HAL_SCCP1_StartOneShot(commDelay);
}

/**
 * @brief Commutation deadline reached — advance to next step.
 * Called from SCCP1 ISR when phase == HWZC_COMM_PENDING.
 */
void HWZC_OnCommDeadline(volatile GARUDA_DATA_T *pData)
{
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;  /* 16-bit, atomic for observer (Rule 13) */
    pData->hwzc.stepsSinceLastHwZc++;

    /* Set up ZC detection for the new step */
    HWZC_OnCommutation(pData);
}

/**
 * @brief ZC timeout — no crossing detected within 2x step period.
 * Called from SCCP1 ISR when phase == HWZC_WATCHING.
 * Either forces a step or falls back to software ZC on miss-limit.
 */
void HWZC_OnTimeout(volatile GARUDA_DATA_T *pData)
{
    /* Capture diagnostics: what did the ADC channel actually see? */
    uint8_t core = pData->hwzc.activeCore;
    if (core == 1)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH5DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH5CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH5CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH5CMP;
    }
    else
    {
        pData->hwzc.dbgTimeoutAdcVal = AD2CH1DATA;
        pData->hwzc.dbgTimeoutThresh = AD2CH1CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD2CH1CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD2CMPSTATbits.CH1CMP;
    }
    pData->hwzc.dbgTimeoutCore = core;
    pData->hwzc.dbgTimeoutStep = pData->currentStep;
    pData->hwzc.dbgTimeoutBemfThresh = pData->bemf.zcThreshold;

    pData->hwzc.missCount++;
    pData->hwzc.totalMissCount++;
    pData->hwzc.stepsSinceLastHwZc++;

    if (pData->hwzc.goodZcCount > 0)
        pData->hwzc.goodZcCount--;

    if (pData->hwzc.missCount >= HWZC_MISS_LIMIT)
    {
        /* Too many misses — fall back to software ZC.
         * Clear goodZcCount to prevent stale synced re-seed.
         * Latch disable to prevent re-enable cycling (preserves diagnostics). */
        pData->hwzc.goodZcCount = 0;
        pData->hwzc.dbgLatchDisable = true;
        HWZC_Disable(pData);
        return;
    }

    /* Forced step: advance commutation and try next step */
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;

    HWZC_OnCommutation(pData);
}

#if HWZC_USE_SW_COMPARE
/**
 * @brief Software ZC detection on a mid-ON ADC sample.
 * Called from the 24 kHz ADC ISR after bemfRaw is populated. Replaces the
 * 1 MHz hardware digital comparator path — mid-ON sampling avoids the
 * 48 kHz phantom-crossing issue where PWM ripple through the board's
 * 5.5 kHz RC filter constantly crosses the threshold.
 *
 * Runs the exact same accept logic as HWZC_OnZcDetected (plausibility gate,
 * IIR update, commDelay scheduling) minus the HW comparator re-arm. State
 * machine (BLANKING → WATCHING → COMM_PENDING) is identical.
 *
 * No-op unless enabled && phase == HWZC_WATCHING && sample is valid.
 */
void HWZC_OnSoftwareSample(volatile GARUDA_DATA_T *pData)
{
    if (!pData->hwzc.enabled) return;
    if (pData->hwzc.phase != HWZC_WATCHING) return;
    if (!pData->bemf.bemfSampleValid) return;   /* AD2 pin-mux settling */

    uint8_t step = pData->currentStep;
    int8_t  pol = commutationTable[step].zcPolarity;
    bool    risingZc = (pol > 0);

    /* Apply deadband/hysteresis matching the HW comparator path */
    uint16_t thresh = pData->bemf.zcThreshold;
    if (risingZc)
        thresh = (thresh + HWZC_CMP_DEADBAND < 4095) ? thresh + HWZC_CMP_DEADBAND : 4095;
    else
        thresh = (thresh > HWZC_CMP_DEADBAND) ? thresh - HWZC_CMP_DEADBAND : 0;

    uint16_t bemfRaw = pData->bemf.bemfRaw;
    bool crossed = risingZc ? (bemfRaw > thresh) : (bemfRaw < thresh);
    if (!crossed) return;

    uint32_t zcStamp = HAL_SCCP2_ReadTimestamp();

    /* First ZC after HWZC_Enable: bypass plausibility gate + skip IIR.
     * See HWZC_OnZcDetected for rationale. */
    if (pData->hwzc.firstZcAfterEnable) {
        pData->hwzc.firstZcAfterEnable = false;
        HAL_SCCP1_Stop();
        pData->hwzc.lastZcStamp = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;

        uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
        {
            uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
            uint16_t advDeg;
            if (eRPM <= RT_RAMP_TARGET_ERPM)
                advDeg = TIMING_ADVANCE_MIN_DEG;
            else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
                advDeg = RT_TIMING_ADV_MAX_DEG;
            else {
                uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
                uint32_t pos   = eRPM - RT_RAMP_TARGET_ERPM;
                advDeg = TIMING_ADVANCE_MIN_DEG +
                    (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                               * pos / range);
            }
            commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
            pData->hwzc.dbgAdvanceDeg = advDeg;
        }
#else
        commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
        if (commDelay < 10) commDelay = 10;
        pData->hwzc.phase = HWZC_COMM_PENDING;
        HAL_SCCP1_StartOneShot(commDelay);
        return;
    }

    /* Plausibility gate: reject intervals shorter than 70% of stepPeriodHR,
     * with RT_HWZC_MIN_STEP_TICKS as hard floor (physical max eRPM). */
    uint32_t interval = zcStamp - pData->hwzc.lastZcStamp;
    uint32_t minInterval = pData->hwzc.stepPeriodHR
                           * HWZC_MIN_INTERVAL_PCT / 100;
    if (minInterval < RT_HWZC_MIN_STEP_TICKS)
        minInterval = RT_HWZC_MIN_STEP_TICKS;

    if (interval < minInterval) {
        pData->hwzc.noiseRejectCount++;
        pData->hwzc.rejectsThisStep++;
        return;  /* stay in WATCHING; timeout still armed */
    }

    /* Cancel timeout */
    HAL_SCCP1_Stop();

    /* Update IIR: see HWZC_OnZcDetected for the freeze-first-N rationale. */
    if (pData->hwzc.stepsSinceLastHwZc == 1
        && pData->hwzc.goodZcCount >= HWZC_IIR_FREEZE_ZC_COUNT) {
        pData->hwzc.writeSeq++;
        uint32_t newPeriod = (3 * pData->hwzc.stepPeriodHR + interval) / 4;
        if (newPeriod < RT_HWZC_MIN_STEP_TICKS)
            newPeriod = RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.stepPeriodHR = newPeriod;
        pData->hwzc.writeSeq++;
    }
    pData->hwzc.stepsSinceLastHwZc = 0;
    pData->hwzc.lastZcStamp = zcStamp;

    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* Schedule commutation (same advance/delay math as HW path) */
    uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
    {
        uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
        uint16_t advDeg;
        if (eRPM <= RT_RAMP_TARGET_ERPM)
            advDeg = TIMING_ADVANCE_MIN_DEG;
        else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
            advDeg = RT_TIMING_ADV_MAX_DEG;
        else {
            uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
            uint32_t pos   = eRPM - RT_RAMP_TARGET_ERPM;
            advDeg = TIMING_ADVANCE_MIN_DEG +
                (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                           * pos / range);
        }
        commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
        pData->hwzc.dbgAdvanceDeg = advDeg;
    }
#else
    commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
    if (commDelay < 10) commDelay = 10;

    pData->hwzc.phase = HWZC_COMM_PENDING;
    HAL_SCCP1_StartOneShot(commDelay);
}
#endif /* HWZC_USE_SW_COMPARE */

#endif /* FEATURE_ADC_CMP_ZC */
